---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateRampError
source: html/cffdfe7a-9352-6e02-4432-bb368e78d08b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateRampError Property

Couldn't generate surfaces for ramp.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGenerateRampError { get; }
```